УНФ_ТЕСТ/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВидыУпаковокИС/ВидыУпаковокИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУпаковокИС</name>
  <enumValues>
    <name>Логистическая</name>
  </enumValues>
  <enumValues>
    <name>Групповая</name>
  </enumValues>
  <enumValues>
    <name>Потребительская</name>
  </enumValues>
  <enumValues>
    <name>Неопределен</name>
  </enumValues>
  <enumValues>
    <name>АкцизнаяМаркаСНомеромИСерией</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/CommonModules/ШтрихкодированиеИССлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет нормализацию значений кодов маркировки для приведения к значениям,
// аналогичным получаемым из сервиса.
// 
// Параметры:
// 	УзелДерева               - ДеревоЗначений,СтрокаДереваЗначений - данные дерева.
// 	ПараметрыНормализацииКМ  - См. РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки.
// 	ИсходныеЗначенияШрихкода - Соответствие - Соответствие строк и исходных значений для восстановления.
Процедура НормализоватьДеревоЗначенийРекурсивно(УзелДерева, ПараметрыНормализацииКМ, ИсходныеЗначенияШрихкода) Экспорт
	
	Для Каждого СтрокаДерева Из УзелДерева.Строки Цикл
		
		НормализоватьДеревоЗначенийРекурсивно(СтрокаДерева, ПараметрыНормализацииКМ, ИсходныеЗначенияШрихкода);
		
		Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции)
			Или СтрокаДерева.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукция Тогда
			
			Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
				
				Если ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции) Тогда
					ПараметрыНормализацииКМ.НачинаетсяСоСкобки = Ложь;
				Иначе
					ПараметрыНормализацииКМ.НачинаетсяСоСкобки = Истина;
				КонецЕсли;
				ПараметрыНормализацииКМ.ВключатьМРЦ          = Ложь;
				ПараметрыНормализацииКМ.ВключатьСрокГодности = Истина;
				
			ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
				
				ПараметрыНормализацииКМ.НачинаетсяСоСкобки   = Истина;
				ПараметрыНормализацииКМ.ВключатьМРЦ          = Ложь;
				ПараметрыНормализацииКМ.ВключатьСрокГодности = Ложь;
				
			ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				И ИнтеграцияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДерева.ВидПродукции)
				И СтрокаДерева.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128 Тогда
				
				ПараметрыНормализацииКМ.НачинаетсяСоСкобки = Ложь;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		КодМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
			СтрокаДерева,
			СтрокаДерева.ВидПродукции,
			ПараметрыНормализацииКМ);
		
		Если СтрокаДерева[ПараметрыНормализацииКМ.ИмяСвойстваКодМаркировки] <> КодМаркировки Тогда
			ИсходныеЗначенияШрихкода.Вставить(СтрокаДерева, СтрокаДерева[ПараметрыНормализацииКМ.ИмяСвойстваКодМаркировки]);
			СтрокаДерева[ПараметрыНормализацииКМ.ИмяСвойстваКодМаркировки] = КодМаркировки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
